{
  "Magnebot(FloorplanController)":
  {
    "Constructor": {
      "description": "",
      "functions": ["__init__"]
    },
    "Scene Setup": {
      "description": "These functions should be sent at the start of the simulation.",
      "functions": ["init_scene"]
    },
    "Movement": {
      "description": "These functions move or turn the Magnebot.\n\n##### Collisions\n\nBy default, the Magnebot will stop moving or turning if it collides with a wall, an object with mass greater than 8, or if the previous action was in the same direction and it ended in a collision (for example, if the previous action was `move_by(1)` and it ended in a collision, `move_by(2)` will immediately fail but `move_by(-0.5)` might succeed). Each move and turn action has an optional `stop_on_collision` parameter that you can set to enable or disable collision detection. For the default collision detection rules, see `Magnebot.COLLISION_ON` and `Magnebot.COLLISION_OFF`. You can fine-tune these settings by [instantiating a new `CollisionDetection` object](collision_detection.md) like this:\n\n```python\nfrom magnebot import Magnebot\nfrom magnebot.collision_detection import CollisionDetection\n\nMagnebot.COLLISION_ON = CollisionDetection(walls=True, objects=True, mass=30)\nm = Magnebot()\n```\n\n##### Tipping\n\nWhile moving, the Magnebot might start to tip over (usually because it's holding something heavy). If this happens, the Magnebot will stop moving and drop any objects with mass > 30. You can then prevent the Magnebot from tipping over.\n\n***",
      "functions": ["turn_by", "turn_to", "move_by", "move_to", "reset_position"]
    },
    "Arm Articulation": {
      "description": "These functions move and bend the joints of the Magnebots's arms.\n\nDuring an arm articulation action, the Magnebot is always \"immovable\", meaning that its wheels are locked and it isn't possible for its root object to move or rotate.\n\nFor more information regarding how arm articulation works, [read this](../arm_articulation.md).",
      "functions": ["reach_for", "grasp", "drop", "reset_arm"]
    },
    "Camera": {
      "description": "These commands rotate the Magnebot's camera or add additional camera to the scene. They advance the simulation by exactly 1 frame.",
      "functions": ["rotate_camera", "reset_camera", "add_camera"]
    },
    "Misc.": {
      "description": "These are utility functions that won't advance the simulation by any frames.",
      "functions": ["get_occupancy_position", "get_visible_objects", "end"]
    },
    "Low-level": {
      "description": "These are low-level functions that you are unlikely to ever need to use.",
      "functions": ["communicate"]
    }
  }
}
